IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
/**-------------------------------------------------------------------------
@file	bt_app_bm.cpp

@brief	Bluetooth application creation helper using baremetal SDK (S145)

This implementation targets the nRF54L15 with SoftDevice S145 via the
sdk-nrf-bm bare-metal framework.  It replaces both the legacy nRF5_SDK
(bt_app_nrf52) and the SDC/MPSL (bt_app_sdc) paths with a thin layer
over the S145 sd_ble_* SVC API, wired through the sdk-nrf-bm observer
infrastructure (nrf_sdh / nrf_sdh_ble).

@author	Hoang Nguyen Hoan
@date	Feb. 13, 2026

@license

MIT License

Copyright (c) 2026 I-SYST INC, all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <stdio.h>
#include <inttypes.h>
#include <atomic>
#include <stdlib.h>
#include <string.h>

#include "nrf_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "nrf_sdm.h"
#include "bm/softdevice_handler/nrf_sdh.h"
#include "bm/softdevice_handler/nrf_sdh_ble.h"
#include "bm/softdevice_handler/nrf_sdh_soc.h"
#include "bm/bluetooth/ble_conn_state.h"
#include "bm/bluetooth/ble_conn_params.h"
#include "bm/bluetooth/peer_manager/peer_manager.h"
#include "bm/bluetooth/peer_manager/peer_manager_handler.h"
#include "bm/bluetooth/peer_manager/nrf_ble_lesc.h"
#include "bm/bluetooth/services/ble_dis.h"

#include "crypto/crypto.h"

// Injection point for the LESC crypto engine (defined in the IOsonata
// nrf_ble_lesc replacement). The App owns the CryptoDev_t and passes it in.
#include "bt_lesc.h"
#include "nrfx_cracen.h"
#include "nrf_soc.h"

#include "istddef.h"
#include "idelay.h"
#include "coredev/system_core_clock.h"
#include "coredev/interrupt.h"
#include "coredev/iopincfg.h"
#include "iopinctrl.h"
#include "bluetooth/bt_uuid.h"
#include "bluetooth/bt_app.h"
#include "bluetooth/bt_appearance.h"
#include "bluetooth/bt_gatt.h"
#include "bluetooth/bt_gap.h"
#include "bluetooth/bt_smp.h"
#include "bluetooth/bt_dev.h"
#include "app_evt_handler.h"

extern "C" bool sdh_state_evt_observer_notify(enum nrf_sdh_state_evt state);

/******** For DEBUG ************/
#define BM_DEBUG_ENABLE

#ifdef BM_DEBUG_ENABLE
#include "coredev/uart.h"
extern UART g_Uart;
#define DEBUG_PRINTF(...)		g_Uart.printf(__VA_ARGS__)
#else
#define DEBUG_PRINTF(...)
#endif

/*******************************/

/// Unit conversion macros (same as old nRF5_SDK definitions)
#define UNIT_0_625_MS					625			/**< Number of microseconds in 0.625 milliseconds. */
#define UNIT_10_MS						10000		/**< Number of microseconds in 10 milliseconds. */
#define MSEC_TO_UNITS(MS, UNIT)			(((MS) * 1000) / (UNIT))

#define BTAPP_CONN_CFG_TAG				CONFIG_NRF_SDH_BLE_CONN_TAG

// Bare-metal fallback polling interval while connected. This guarantees generic
// SMP/GATT transaction timeouts advance even when the peer goes fully silent.
// RTOS ports should override BtAppEvtWait with a blocking primitive plus timer.
#define BTAPP_TIMEOUT_POLL_MS			100U

#define BTAPP_OBSERVER_PRIO				USER		/**< Application's BLE observer priority. */

#ifndef GATT_MTU_SIZE_DEFAULT
#if defined(BLE_GATT_ATT_MTU_DEFAULT)
#define GATT_MTU_SIZE_DEFAULT			BLE_GATT_ATT_MTU_DEFAULT
#elif defined(BLE_GATT_MTU_SIZE_DEFAULT)
#define GATT_MTU_SIZE_DEFAULT			BLE_GATT_MTU_SIZE_DEFAULT
#else
#define GATT_MTU_SIZE_DEFAULT			23
#endif
#endif

#define SEC_PARAM_MIN_KEY_SIZE			7			/**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE			16			/**< Maximum encryption key size. */

// S145 tx_power values (nRF54L15)
static const int8_t s_TxPowerdBm[] = {
	-40, -20, -16, -12, -8, -4, 0, 2, 3, 4, 5, 6, 7, 8
};
static const int s_NbTxPowerdBm = sizeof(s_TxPowerdBm) / sizeof(int8_t);

// g_BtAppData definition and helpers (isConnected, BtConnected, BtInitialized,
// BtAppGetConnHandle, BtAppConnLedOff/On) moved to src/bluetooth/bt_app.cpp.

// --- Advertisement packet buffers ---


// --- Scan buffer for central / observer mode ---
// S145 on nRF54L15 caps extended-adv data at BLE_GAP_SCAN_BUFFER_EXTENDED_MAX_SUPPORTED (255).
// Same buffer covers legacy 31-byte scans too.


const static TimerCfg_t s_BtAppSdTimerCfg = {
    .DevNo = 3,	// GRTC3 needed for Softdevice
	.ClkSrc = TIMER_CLKSRC_DEFAULT,
	.Freq = 0,			// 0 => Default frequency
	.IntPrio = 6,		// GRTC3 interrupt remains disabled; the SoftDevice owns the IRQ.
	.EvtHandler = nullptr,
	.bTickInt = false,
};

static Timer s_BtAppSdGrtc3;
static volatile uint16_t s_SecurePendingHdl = BLE_CONN_HANDLE_INVALID;

// --- Helper functions ---

int8_t GetValidTxPower(int TxPwr)
{
	int8_t retval = s_TxPowerdBm[0];

	for (int i = 1; i < s_NbTxPowerdBm; i++)
	{
		if (s_TxPowerdBm[i] > TxPwr)
			break;
		retval = s_TxPowerdBm[i];
	}

	return retval;
}

// --- Conn params event handler ---

static void on_conn_params_evt(const struct ble_conn_params_evt *p_evt)
{
	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_ERROR)
	{
		sd_ble_gap_disconnect(BtAppGetConnHandle(),
							  BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
	}
}

// Central GATT client discovery (S145). Single active discovery at a time.
// Bodies live in the Central / Observer section near BtAppConnect.
static void BtAppDiscPrimSrvcRsp(const ble_gattc_evt_t *pEvt);
static void BtAppDiscCharRsp(const ble_gattc_evt_t *pEvt);
static void BtAppDiscDescRsp(const ble_gattc_evt_t *pEvt);

