IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			const ble_gap_phys_t phys = {
				BLE_GAP_PHY_AUTO,
				BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
			(void)err_code;
		}
		break;

		case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
		{
			ble_gap_data_length_params_t dl_params;
			memset(&dl_params, 0, sizeof(dl_params));
			err_code = sd_ble_gap_data_length_update(
				p_ble_evt->evt.gap_evt.conn_handle, &dl_params, NULL);
			(void)err_code;
		}
		break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			err_code = sd_ble_gatts_sys_attr_set(
				BtAppGetConnHandle(), NULL, 0, 0);
			(void)err_code;
			break;

		case BLE_EVT_USER_MEM_REQUEST:
			{
				// Long write: hand the SoftDevice this link's reassembly buffer.
				// Replied once per connection (not per service) to avoid
				// multiple sd_ble_user_mem_reply calls on the same request.
				BtDevice_t *pConn = BtPeerFindByHdl(p_ble_evt->evt.common_evt.conn_handle);
				if (pConn != nullptr && pConn->Conn.pLongWrBuff != nullptr)
				{
					ble_user_mem_block_t mblk;
					memset(&mblk, 0, sizeof(mblk));
					mblk.p_mem = pConn->Conn.pLongWrBuff;
					mblk.len   = pConn->Conn.LongWrBuffSize;
					memset(pConn->Conn.pLongWrBuff, 0, pConn->Conn.LongWrBuffSize);
					err_code = sd_ble_user_mem_reply(p_ble_evt->evt.common_evt.conn_handle, &mblk);
					(void)err_code;
				}
			}
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
								  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			break;

		case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
		{
			uint16_t mtu = g_BtAppData.AppDevice.Conn.MaxMtu;
			err_code = sd_ble_gatts_exchange_mtu_reply(
				p_ble_evt->evt.gatts_evt.conn_handle, mtu);
			(void)err_code;
		}
		break;

		default:
			break;
	}

	// Forward to central/observer handlers
	if ((role == BLE_GAP_ROLE_CENTRAL) ||
		(g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_CENTRAL | BTAPP_ROLE_OBSERVER)))
	{
		switch (p_ble_evt->header.evt_id)
		{
			case BLE_GAP_EVT_ADV_REPORT:
			{
				const ble_gap_evt_adv_report_t *p_adv_report =
					&p_gap_evt->params.adv_report;
				bool keep_going = BtAppScanReport(p_adv_report->rssi,
								p_adv_report->peer_addr.addr_type,
								(uint8_t *)p_adv_report->peer_addr.addr,
								p_adv_report->data.len,
								p_adv_report->data.p_data);
				// S145 stops reporting after each adv packet; the app must
				// re-arm the scan or explicitly stop it.
				if (keep_going)
				{
					BtAppScan();
				}
				else
				{
					BtAppScanStop();
				}
			}
			break;

			case BLE_GAP_EVT_TIMEOUT:
			{
				const ble_gap_evt_timeout_t *p_timeout =
					&p_gap_evt->params.timeout;
				if (p_timeout->src == BLE_GAP_TIMEOUT_SRC_SCAN)
				{
					g_BtAppData.bScan = false;
				}
			}
			break;

			case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
				BtAppDiscPrimSrvcRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_CHAR_DISC_RSP:
				BtAppDiscCharRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_DESC_DISC_RSP:
				BtAppDiscDescRsp(&p_ble_evt->evt.gattc_evt);
				break;

			case BLE_GATTC_EVT_HVX:
				{
					const ble_gattc_evt_hvx_t *p_hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
					BtGattClientNotified(p_ble_evt->evt.gattc_evt.conn_handle,
					                     p_hvx->handle, (uint8_t *)p_hvx->data, p_hvx->len);
					// An indication must be confirmed by the client.
					if (p_hvx->type == BLE_GATT_HVX_INDICATION)
					{
						sd_ble_gattc_hv_confirm(p_ble_evt->evt.gattc_evt.conn_handle,
						                        p_hvx->handle);
					}
				}
				break;

			default:
				break;
		}
		BtAppCentralEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}

	// Forward to peripheral handlers
	if (g_BtAppData.AppDevice.Conn.Role & BTAPP_ROLE_PERIPHERAL)
	{
		// HVN TX complete gives a count, not a handle. Drain the per-peer
		// send-order ring once per event.
		if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVN_TX_COMPLETE)
		{
			BtGattSendCompleted(p_ble_evt->evt.gatts_evt.conn_handle,
				p_ble_evt->evt.gatts_evt.params.hvn_tx_complete.count);
		}
		else if (p_ble_evt->header.evt_id == BLE_GATTS_EVT_HVC)
		{
			// Client confirmed the outstanding indication.
			BtGattHandleValueConfirm(p_ble_evt->evt.gatts_evt.conn_handle);
		}
		BtGattEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
		BtAppPeriphEvtHandler((uint32_t)p_ble_evt->header.evt_id, (void *)p_ble_evt);
	}
}

// Note: SoC event polling is handled internally by nrf_sdh_soc.c
// which registers its own NRF_SDH_STACK_EVT_OBSERVER.

// --- Advertising ---


/**
 * @brief Overloadable advertising initialization
 */


// --- Notify ---

bool BtAppNotify(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (pChar == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && pData == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && BtGattCharSetValue(pChar, pData, DataLen) == false)
	{
		return false;
	}

	// Delegate the send to BtGattCharNotify so the notification is tracked in
	// the TX-pending ring and TxCompleteCB fires on completion.
	return BtGattCharNotify(BtAppGetConnHandle(), pChar, pData, DataLen);
}

bool BtAppIndicate(BtGattChar_t *pChar, uint8_t *pData, uint16_t DataLen)
{
	if (pChar == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && pData == nullptr)
	{
		return false;
	}

	if (DataLen > 0 && BtGattCharSetValue(pChar, pData, DataLen) == false)
	{
		return false;
	}

	// Delegate to BtGattCharIndicate so the indication is tracked: pending flag,
	// transaction timeout, and TX-pending ring.
	return BtGattCharIndicate(BtAppGetConnHandle(), pChar, pData, DataLen);
}

// --- Disconnect ---

void BtAppDisconnect()
{
	if (BtAppGetConnHandle() != BLE_CONN_HANDLE_INVALID)
	{
		uint32_t err_code = sd_ble_gap_disconnect(
			BtAppGetConnHandle(),
			BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
		{
			DEBUG_PRINTF("BtAppDisconnect failed: 0x%x\r\n", err_code);
		}
	}
}

void BtAppGapDeviceNameSet(const char *pDeviceName)
{
	BtGapSetDevName(pDeviceName);
}

void BtAppEnterDfu()
{
	// Not supported on nRF54L15 S145 yet
	NVIC_SystemReset();
}

// --- DIS initialization ---

static void BtDisInit(const BtAppCfg_t *pCfg)
{
	// sdk-nrf-bm DIS uses Kconfig values for device info strings.
	// Call ble_dis_init() with security settings based on SecType.
	// Note: BLE_DIS_CONFIG_SEC_MODE_DEFAULT uses C nested designated
	// initializers (.device_info_char.read = ...) which are not valid
	// in C++. Initialize manually.
	struct ble_dis_config dis_cfg = {};
	dis_cfg.sec_mode.device_info_char.read.sm = 1;
	dis_cfg.sec_mode.device_info_char.read.lv = 1;

