IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
	g_BtAppData.AppDevice.Conn.MaxMtu = GATT_MTU_SIZE_DEFAULT;
	if (pCfg->MaxMtu > GATT_MTU_SIZE_DEFAULT)
		g_BtAppData.AppDevice.Conn.MaxMtu = pCfg->MaxMtu;

	// Setup connection LED
	if (pCfg->ConnLedPort != -1 && pCfg->ConnLedPin != -1)
	{
		IOPinConfig(pCfg->ConnLedPort, pCfg->ConnLedPin, 0,
					IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
		BtAppConnLedOff();
	}

	// Initialize SoftDevice + BLE stack
	if (BtAppStackInit(pCfg) == false)
	{
		DEBUG_PRINTF("BtAppStackInit failed\r\n");
		return false;
	}


	// Set GAP appearance
	err_code = sd_ble_gap_appearance_set(pCfg->Appearance);
	(void)err_code;

	// Initialize GAP parameters
	BtGapCfg_t gapcfg = {
		.Role = pCfg->Role,
		.SecType = pCfg->SecType,
		.AdvInterval = pCfg->AdvInterval,
		.AdvTimeout = pCfg->AdvTimeout,
		.ConnIntervalMin = pCfg->ConnIntervalMin,
		.ConnIntervalMax = pCfg->ConnIntervalMax,
		.SlaveLatency = BT_GAP_CONN_SLAVE_LATENCY,
		.SupTimeout = BT_GAP_CONN_SUP_TIMEOUT
	};

	BtGapInit(&gapcfg);

	if (pCfg->pDevName != NULL)
	{
		BtGapSetDevName(pCfg->pDevName);
	}

	// Register connection parameters event handler
	ble_conn_params_evt_handler_set(on_conn_params_evt);

	// Initialize user services
	DEBUG_PRINTF("BtAppInit: Role=0x%x PERIPHERAL=%d\r\n",
		pCfg->Role, (pCfg->Role & BTAPP_ROLE_PERIPHERAL) ? 1 : 0);
	if (pCfg->Role & BTAPP_ROLE_PERIPHERAL)
	{
		DEBUG_PRINTF("BtAppInit: calling BtAppInitUserServices\r\n");
		BtAppInitUserServices();
	}

	// Initialize Device Information Service
	if (pCfg->pDevInfo != NULL)
	{
		BtDisInit(pCfg);
	}

	// Initialize user data
	BtAppInitUserData();

	g_BtAppData.AppDevice.bSecure = pCfg->SecType != BTGAP_SECTYPE_NONE;

	// Initialize Secure Connections (peer_manager + LESC) when the app
	// requests security. Bonds persist through the IOsonata bt_pds store.
	if (g_BtAppData.AppDevice.bSecure)
	{
		// No erase-bond flag in BtAppCfg_t; bonds are preserved across init.
		// A dedicated clear (pm_peers_delete / BtSmpBondClearAll) can be added
		// as a separate API if forced re-bonding is needed.
		if (BtAppPeerMngrInit(pCfg->SecType, pCfg->SecExchg, false) != NRF_SUCCESS)
		{
			DEBUG_PRINTF("BtAppPeerMngrInit failed\r\n");
			return false;
		}
	}

	// Initialize advertising
	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		if (BtAppAdvInit(pCfg) == false)
		{
			DEBUG_PRINTF("BtAppAdvInit failed\r\n");
			return false;
		}

		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_ADV,
			g_BtAppData.AdvHdl,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}
	else
	{
		err_code = sd_ble_gap_tx_power_set(
			BLE_GAP_TX_POWER_ROLE_SCAN_INIT,
			0,
			GetValidTxPower(pCfg->TxPower));
		(void)err_code;
	}

	g_BtAppData.State = BTAPP_STATE_INITIALIZED;

	DEBUG_PRINTF("BtAppInit: success\r\n");

	return true;
}

/**
 * @brief Main BLE application run loop.
 *
 * Starts advertising (if peripheral/broadcaster) then enters the
 * main event loop.  SoftDevice events are dispatched through the
 * observer infrastructure triggered by the SD_EVT interrupt.
 */
// Millisecond clock for the generic SMP/GATT transaction timeouts, overriding
// the weak BtSmpMsTick/BtGattMsTick defaults. The RTC/timer is owned by the
// SDK + SoftDevice; this reads the free-running GRTC3 count via the s_BtAppSdGrtc3
// handle the port enables as a SoftDevice prerequisite (a read is
// non-destructive). Declared in bt_smp.h / bt_gatt.h, so no linkage specifier is
// needed here.
uint32_t BtSmpMsTick(void)
{
	return s_BtAppSdGrtc3.mSecond();
}

uint32_t BtGattMsTick(void)
{
	return s_BtAppSdGrtc3.mSecond();
}

// Spec-strict indication transaction timeout: Core Vol 3 Part F 3.3.3 requires
// closing the bearer, so disconnect the link. Overrides the generic weak
// default that only clears the outstanding-indication flag.
void BtGattIndicationTimeout(uint16_t ConnHdl)
{
	sd_ble_gap_disconnect(ConnHdl, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void BtAppRun()
{
	if (g_BtAppData.State != BTAPP_STATE_INITIALIZED)
	{
		return;
	}

	if (g_BtAppData.AppDevice.Conn.Role & (BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
	{
		BtAdvStart();
	}

	DEBUG_PRINTF("BtAppRun: entering main loop\r\n");

	while (1)
	{
		uint16_t connHdl = BLE_CONN_HANDLE_INVALID;
		uint32_t intState = DisableInterrupt();

		if (s_SecurePendingHdl != BLE_CONN_HANDLE_INVALID)
		{
			connHdl = s_SecurePendingHdl;
			s_SecurePendingHdl = BLE_CONN_HANDLE_INVALID;
		}

		EnableInterrupt(intState);

		if (connHdl != BLE_CONN_HANDLE_INVALID)
		{
			uint32_t err = pm_conn_secure(connHdl, false);
			DEBUG_PRINTF("pm_conn_secure hdl=%u returned 0x%08" PRIx32 "\r\n",
				connHdl, err);
		}

		// Process any pending LESC DHKey computation. Required for LE Secure
		// Connections: nrf_ble_lesc defers the ECDH to be run from the main
		// loop rather than the BLE event context.
		if (g_BtAppData.AppDevice.bSecure)
		{
			(void)BtLescRequestHandler();
		}

		AppEvtHandlerExec();

		// The S145 port uses Peer Manager for SMP. Only the generic GATT
		// indication timeout remains here.
		BtGattIndicationTimeoutCheck();

		BtAppEvtWait();
	}
}

// Port-level weak default for BtAppEvtWait. Bare-metal apps use __WFE.
// RTOS apps override with sem take in their bridge code.
__attribute__((weak)) void BtAppEvtWait(void)
{
	if (BtPeerIsConnected())
	{
		msDelay(BTAPP_TIMEOUT_POLL_MS);
	}
	else
	{
		__WFE();
	}
}

// Drains queued SoftDevice stack events by running the registered observers.
// Effect: pending stack events are delivered to their handlers. Precondition:
// SoftDevice enabled. Called from an RTOS BtAppEvtWait override after the
// waiter unblocks, so observers run in task context. Returns void.
void BtAppEvtDispatch()
{
	nrf_sdh_evts_poll();
}

static void soc_evt_poll(void *context)
{
	uint32_t nrf_err;
	uint32_t evt_id;

	DEBUG_PRINTF("soc_evt_poll\r\n");
	while (true) {
		nrf_err = sd_evt_get(&evt_id);
		if (nrf_err) {
			break;
		}

		/* Forward the event to SoC observers. */
		TYPE_SECTION_FOREACH(
			struct nrf_sdh_soc_evt_observer, nrf_sdh_soc_evt_observers, obs) {
			obs->handler(evt_id, obs->context);
		}
	}

	__ASSERT(nrf_err == NRF_ERROR_NOT_FOUND,
		 "Failed to receive SoftDevice SoC event, nrf_error %#x", nrf_err);
}

