IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
/*
 * BLE event pumping is handled by the SDK nrf_sdh_ble.c ble_evt_poll, which is
 * registered as NRF_SDH_STACK_EVT_OBSERVER(ble_evt_obs, ...). That function
 * maintains the connection-handle index table (idx_assign on CONNECTED,
 * idx_unassign on DISCONNECTED) that nrf_sdh_ble_idx_get / peer_manager
 * conn_state rely on, then fans the event out to all NRF_SDH_BLE_OBSERVERs.
 * IOsonata's own GAP/GATT handling is one such observer (ble_evt_dispatch,
 * registered below). A second pump here would also drain sd_ble_evt_get and
 * fan out without the idx tracking, leaving nrf_sdh_ble_idx_get returning -1,
 * so it is intentionally not defined.
 */

/* Auto-handle seed requests as a SoC event observer */
NRF_SDH_SOC_OBSERVER(rand_seed, SDBleRandSeed, NULL, HIGH);
/* SoftDevice SoC event pump (BLE pump is the SDK nrf_sdh_ble.c one) */
NRF_SDH_STACK_EVT_OBSERVER(soc_evt_obs, soc_evt_poll, NULL, HIGHEST);
/* IOsonata GAP/GATT handling, driven by the SDK BLE event fan-out */
NRF_SDH_BLE_OBSERVER(s_BtAppBleObserver, ble_evt_dispatch, NULL, USER);



// =====================================================================
// Central / Observer role
// ---------------------------------------------------------------------
// BtAppScanInit programs the scan parameters and arms the first scan.
// BtAppScan continues an in-flight scan (after each ADV_REPORT) or
// starts a fresh one if scanning was idle.
// BtAppScanStop halts scanning.
// BtAppConnect issues a GAP connect request using the parameters that
// were set up by the most recent BtAppScanInit call.
// =====================================================================


bool BtAppConnect(BtGapPeerAddr_t * const pPeerAddr, BtGapConnParams_t * const pConnParam)
{
	// SD requires scanning to be stopped before issuing a connect.
	g_BtAppData.bScan = false;

	return BtGapConnect(pPeerAddr, pConnParam);
}

// =====================================================================
// Central GATT client discovery (S145 SoftDevice path)
// ---------------------------------------------------------------------
// S145 owns the host. There is no BtHciDevice_t, so the ATT engine in
// bt_attreq.cpp / bt_attrsp.cpp does not apply here. Discovery runs on
// sd_ble_gattc_*_discover and the matching BLE_GATTC_EVT_* responses.
//
// Sequence: all primary services, then characteristics per service, then
// descriptors per characteristic to resolve the CCCD handle. On completion
// BtDeviceDiscovered(pDev) is called (weak default in bt_app.cpp, overridden
// by the app).
//
// Single active discovery at a time. The cursor lives in file-scope statics,
// not per peer, so concurrent central links are not supported yet. Per-link
// discovery would move this cursor into pDev->Discovery.
// =====================================================================

static BtDevice_t *s_pDiscDev    = NULL;    // peer under discovery
static uint8_t     s_DiscSrvIdx  = 0;       // service cursor (char and desc phases)
static uint8_t     s_DiscCharIdx = 0;       // characteristic cursor (desc phase)

static void BtAppDiscStartChar(BtDevice_t *pDev);
static void BtAppDiscStartDesc(BtDevice_t *pDev);

bool BtAppDiscoverDevice(BtDevice_t * const pDev)
{
	if (pDev == NULL)
	{
		return false;
	}

	s_pDiscDev    = pDev;
	s_DiscSrvIdx  = 0;
	s_DiscCharIdx = 0;

	pDev->NbSrvc = 0;
	memset(pDev->Services, 0, sizeof(BtGattDBSrvc_t) * BT_DEV_SERVICE_MAXCNT);

	// NULL uuid filter discovers every primary service from handle 1.
	return sd_ble_gattc_primary_services_discover(pDev->Conn.Hdl, 0x0001, NULL) == NRF_SUCCESS;
}

static void BtAppDiscStartChar(BtDevice_t *pDev)
{
	while (s_DiscSrvIdx < pDev->NbSrvc)
	{
		BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];
		ble_gattc_handle_range_t range;

		range.start_handle = pSrvc->handle_range.StartHdl + 1;  // skip service declaration
		range.end_handle   = pSrvc->handle_range.EndHdl;

		if (range.start_handle <= range.end_handle &&
		    sd_ble_gattc_characteristics_discover(pDev->Conn.Hdl, &range) == NRF_SUCCESS)
		{
			return;     // wait for BLE_GATTC_EVT_CHAR_DISC_RSP
		}
		s_DiscSrvIdx++; // empty service or request rejected; advance
	}

	// All services covered for characteristics. Resolve descriptors (CCCD).
	s_DiscSrvIdx  = 0;
	s_DiscCharIdx = 0;
	BtAppDiscStartDesc(pDev);
}

static void BtAppDiscStartDesc(BtDevice_t *pDev)
{
	while (s_DiscSrvIdx < pDev->NbSrvc)
	{
		BtGattDBSrvc_t *pSrvc = &pDev->Services[s_DiscSrvIdx];

		while (s_DiscCharIdx < pSrvc->char_count)
		{
			BtGattDBChar_t *pCh    = &pSrvc->characteristics[s_DiscCharIdx];
			uint16_t        valHdl = pCh->characteristic.handle_value;
			uint16_t        start  = valHdl + 1;
			uint16_t        end;

			if ((s_DiscCharIdx + 1) < pSrvc->char_count)
			{
				end = pSrvc->characteristics[s_DiscCharIdx + 1].characteristic.handle_decl - 1;
			}
			else
			{
				end = pSrvc->handle_range.EndHdl;
			}

			if (valHdl != 0xFFFF && start <= end)
			{
				ble_gattc_handle_range_t range;
				range.start_handle = start;
				range.end_handle   = end;
				if (sd_ble_gattc_descriptors_discover(pDev->Conn.Hdl, &range) == NRF_SUCCESS)
				{
					return; // wait for BLE_GATTC_EVT_DESC_DISC_RSP
				}
			}
			s_DiscCharIdx++; // no descriptor range or request rejected
		}
		s_DiscSrvIdx++;
		s_DiscCharIdx = 0;
	}

	// Every service and characteristic processed. Discovery complete.
	BtDeviceDiscovered(pDev);
}

static void BtAppDiscPrimSrvcRsp(const ble_gattc_evt_t *pEvt)
{
	BtDevice_t *pDev = s_pDiscDev;
	if (pDev == NULL)
	{
		return;
	}

	if (pEvt->gatt_status == BLE_GATT_STATUS_SUCCESS)
	{
		const ble_gattc_evt_prim_srvc_disc_rsp_t *p = &pEvt->params.prim_srvc_disc_rsp;
		uint16_t lastEnd = 0;

		for (uint16_t i = 0; i < p->count; i++)
		{
			if (pDev->NbSrvc >= BT_DEV_SERVICE_MAXCNT)
			{
				break;
			}

			BtGattDBSrvc_t *pSrvc = &pDev->Services[pDev->NbSrvc];
			pSrvc->srv_uuid.BaseIdx = 0;
			pSrvc->srv_uuid.Type    = BT_UUID_TYPE_16;
			pSrvc->srv_uuid.Uuid    = p->services[i].uuid.uuid;
			pSrvc->handle_range.StartHdl = p->services[i].handle_range.start_handle;
			pSrvc->handle_range.EndHdl   = p->services[i].handle_range.end_handle;
			pSrvc->char_count = 0;
			lastEnd = p->services[i].handle_range.end_handle;
			pDev->NbSrvc++;
		}

		// Continue past the last range unless DB end or local table full.
		if (lastEnd != 0xFFFF && pDev->NbSrvc < BT_DEV_SERVICE_MAXCNT &&
		    sd_ble_gattc_primary_services_discover(pDev->Conn.Hdl, lastEnd + 1, NULL) == NRF_SUCCESS)
		{
			return;
		}
	}

	// ATTRIBUTE_NOT_FOUND, DB end, or table full: service phase done.
	s_DiscSrvIdx = 0;
	BtAppDiscStartChar(pDev);
}

